// 1. Определение текущего размера окна браузера:
// ○ Напишите функцию, которая будет выводить текущую ширину и высоту окна браузера при его изменении.
// 2. Подтверждение закрытия страницы:
// ○ Создайте всплывающее окно или диалоговое окно, которое появляется при попытке закрыть вкладку
// браузера и спрашивает пользователя, уверен ли он в своем решении закрыть страницу.
// 3. Управление историей переходов:
// ○ Используйте объект history для управления историей переходов на веб-странице. Создайте кнопки "Назад" и
// "Вперед" для перемещения по истории.


function showSize() {
    const outputEl = document.querySelector('.size');
    outputEl.textContent = `Ширина окна: ${document.documentElement.clientWidth}px; высота окна: ${document.documentElement.clientHeight}px`;
}

window.addEventListener('resize', showSize);



showSize();

